## Subset Observations (Rows)

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(
        {"a" : [4 ,5, 6, 6, np.nan],
        "b" : [7, 8, 9, 9, np.nan],
        "c" : [10, 11, 12, 12, np.nan]},
        index = pd.MultiIndex.from_tuples(
        [('d',1),('d',2),('e',2),('e',3),('e', 4)],
        names=['n','v']))
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  9.0  12.0
  3  6.0  9.0  12.0
  4  NaN  NaN   NaN

In [3]:
df[df.a < 5]

       a    b     c
n v
d 1  4.0  7.0  10.0

In [4]:
df = df.drop_duplicates(keep='last')

In [5]:
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 3  6.0  9.0  12.0
  4  NaN  NaN   NaN

In [6]:
df.head(2)

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0

In [7]:
df.tail(2)

       a    b     c
n v
e 3  6.0  9.0  12.0
  4  NaN  NaN   NaN

In [8]:
df.sample(frac=0.5)  # Randomly select fraction of rows.

       a    b     c
n v
d 1  4.0  7.0  10.0
e 4  NaN  NaN   NaN

In [9]:
df.sample(n=2)  # Randomly select n rows.

       a    b     c
n v
d 2  5.0  8.0  11.0
e 4  NaN  NaN   NaN

In [10]:
df.iloc[0:2]

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0

In [11]:
df.nlargest(3, 'a')  # Select and order top n entries.

       a    b     c
n v
e 3  6.0  9.0  12.0
d 2  5.0  8.0  11.0
  1  4.0  7.0  10.0

In [12]:
df.nsmallest(3, 'a')  # Select and order bottom n entries.

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 3  6.0  9.0  12.0

### Logic in Python (and pandas)

* &,|,~,^,df.any(),df.all()
* and, or, not, xor, any, all

In [13]:
df[(df.b == 7) | (df.a == 5)]

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0

In [14]:
df[df["b"] != 7]

       a    b     c
n v
d 2  5.0  8.0  11.0
e 3  6.0  9.0  12.0
  4  NaN  NaN   NaN

In [15]:
df.a.isin([5])

n  v
d  1    False
   2     True
e  3    False
   4    False
Name: a, dtype: bool

In [16]:
pd.isnull(df)

         a      b      c
n v
d 1  False  False  False
  2  False  False  False
e 3  False  False  False
  4   True   True   True

In [17]:
df['a'].isnull().sum()

1

In [18]:
pd.notnull(df)

         a      b      c
n v
d 1   True   True   True
  2   True   True   True
e 3   True   True   True
  4  False  False  False

In [19]:
df.notnull().sum()

a    3
b    3
c    3
dtype: int64

In [20]:
df.a.notnull()

n  v
d  1     True
   2     True
e  3     True
   4    False
Name: a, dtype: bool